Added fixes to some Bugs and some typos
